{
    "name": "Niagara University",
    "subject": "Math",
    "time_estimate": "50 minutes",
    "student_count": "25",
    "grade": "Grade 4",
    "date": "2025-05-16",
    "learning_objectives": "By the end of this lesson, students will be able to:\n  Identify and classify angles (acute, right, and obtuse) by examining everyday objects and images, demonstrating their understanding verbally and on a worksheet with at least 80% accuracy.",
    "i_can_statements": "I can identify and name acute, right, and obtuse angles.\nI can measure angles using a protractor.\nI can find examples of angles in the world around me.\nI can tell angles",
    "curriculum_expectations": "E1.1 identify geometric properties of rectangles, including the number of right angles, paralleland perpendicular sides, and lines of symmetry\nE2.4 identify angles and classify them as right, straight, acute, or obtuse",
    "student_materials": "Printed or digital worksheet on angle measurement and classification.\nSticky notes (for exit ticket).\nPencil/eraser.",
    "teacher_materials": "Google Slides presentation with animations.\nIndependent practice worksheet.",
    "prior_knowledge": "Students should have:\n  Familiarity with common shapes and basic measurement concepts.\n  Basic understanding of geometric vocabulary (line, vertex, angle).",
    "prep_ahead": "Prepare and test the Google Slides presentation with all animations and transitions.\nPrint copies of worksheets.\nVerify that the transparent protractor PNG displays correctly on the presentation.\nSet up sticky notes for the exit ticket activity.",
    "anticipatory": "Begin with a hook by displaying images of everyday objects (scissors, pizza slice, door, book corner).\n\nIntroduce the activity:\n  \"Today, we’re going to explore angles and learn how to measure them!”",
    "mini_lesson": "Test",
    "activity_1": "",
    "activity_2": "Guided Practice on Measuring Angles\n\n\nIntroduce the slide titled “What Is a Protractor?” explaining that it is a tool used to measure how wide an angle is.\nUse a slide “How to Measure an Angle” with these child-friendly steps:\nPut the Protractor in Place: Place the middle of the flat side of the protractor right on the corner (vertex) of the angle.\nLine Up the Angle: Make sure one side of the angle lines up with the 0° mark.\nRead the Number: Look where the other side points—the number is the angle’s measurement.\nTransition to the slide “Measuring Angles with Our Protractor,” where you overlay your transparent PNG of a protractor on three angle examples (Angle A, Angle B, Angle C).\nGuidelines:\n  Make sure the protractor image is visible and that each step is clearly animated.\n  Remind students to watch closely and think about each step before the answer is revealed.\n  Use clear and concise language, and repeat steps if needed.\n  Encourage students to ask questions if they’re unsure about any part of the process.\n\n\nTeacher Prompts:\n  “What do you notice about where the 0° mark is on our protractor? ”\n  “Before I reveal the measurement for Angle A, who can guess if it’s acute, right, or obtuse?”\n  “If you were measuring this angle at home, what step would you do first?”",
    "activity_3": "Independent Practice\nTask: \n  Distribute or display the independent practice worksheet.\n  Instructions on the slide: “Your Turn! Look at each angle on your worksheet. Use a protractor (or the strategies we learned) to decide if each angle is acute (less than 90°), right (exactly 90°), or obtuse (more than 90°). Write your answers.”\nGuidelines:\n  Ensure every student has access to a copy.\n  Remind students to take their time and double-check their work.\n  Walk around to provide support to those who need extra help.\n  Encourage collaboration or discussion in small groups if appropriate, while ensuring each student works independently.\n\n\nTeacher Prompts:\n  “Who would like to share the answer for the first angle? Tell us if it’s acute, right, or obtuse!”\n  “What was the trickiest angle to decide on, and why do you think that was?”\n  “Does anyone have a strategy they used to figure out the measurement that worked really well?”",
    "technology": "Overhead Projector/Interactive Whiteboard: Used to display the printed slides and demonstrations of how to measure angles using a transparent protractor image.\nPrinted Materials: Hard copies of the worksheet, angle diagrams, and protractor examples will be provided to all students.\nTraditional Tools: Chalk/markers, a physical protractor, and a whiteboard for live demonstrations.",
    "unfinished": "If students do not complete their worksheet in class:\nThey will finish the independent practice worksheet as homework and bring their completed work to the next lesson for review.\n\n\nFor early finishers:\nThey will be given an extension challenge: Find two additional examples of angles in the classroom or at home, classify each as acute, right, or obtuse, and write a short explanation for each.\nAlternatively, early finishers can write a brief reflection describing the steps they use to measure an angle with a protractor in their own words.",
    "alt_plan": "If any issues arise during the lesson (for example, if the overhead projector or interactive board is unavailable), I will:\nVerbally describe key visuals and demonstrations while using a traditional whiteboard or chalkboard to sketch the protractor, angles, and measurement steps.\nDistribute printed copies of the worksheet and angle diagrams ahead of time so that every student has a physical reference.\nIf student engagement is low (e.g., few responses during discussion), I will:\nRandomly call on students and use quick visual prompts (such as “Show me your angle using your arms” or “Raise your hand if you think this angle is acute”) to stimulate participation.",
    "struggle_1": "Short, Structured Segments: Break the lesson into brief, manageable parts (introduction, guided practice, independent practice) with clear transitions to maintain focus.",
    "struggle_2": "",
    "ell_1": "Sentence Stems and Word Banks: \n  Use structured prompts during discussions (e.g., “An acute angle is smaller than ___ because ___” or “I measure an angle by placing the protractor at the ___”) to support language development.",
    "ell_2": "",
    "gifted_1": "",
    "gifted_2": "",
    "closure": "Activity: Use the “Wrap-Up & Reflection” slide to review key concepts.\n  Teacher Script: “Let’s quickly review: Acute angles are smaller than 90°, right angles are exactly 90°, and obtuse angles are bigger than 90°. What surprised you about angles today? Think about one thing you learned and share it in the chat.”\nWrap-Up: Summarize and thank students for their participation.\nTransition: Move to the exit ticket activity.",
    "formal_assessment": "Independent Practice Worksheet:\n  Rationale: \n    This worksheet directly measures students’ ability to identify, classify, and measure angles. Achieving 80% or higher indicates mastery.\n\nExit Ticket:\n  Rationale: \n    The exit ticket (answering “What type of angle is shown at 3:00 on a clock?”) provides a quick, clear measure of understanding of key concepts.",
    "informal_assessment": "Class Discussions and Responses:\n  Rationale: \n    Monitoring responses during guided practice and discussions offers real-time feedback on student understanding.\n\nTeacher Observation:\n  Rationale: \n    Observing student participation during the hands-on activities (e.g., arm movements and independent practice) helps identify areas needing further clarification.",
    "apa_references": "",
    "topic": "Identifying Angles",
    "appendix_files": [
        "C:/Users/Josh/Downloads/Chfeature.png"
    ],
    "appendix_text": ""
}